# 19CSE305 ML - Pandas Exercise Questions - 30th Sep 2022

### Task 1. Go to https://www.kaggle.com/openfoodfacts/world-food-facts/data

### Task 2. Download the dataset to your computer and unzip it.

### Task 3. Use the tsv file and assign it to a dataframe called food

In [43]:
import pandas as pd
import numpy as np
df1=pd.read_csv(r"C:\Users\DHANUPRASAD\OneDrive - Amrita Vishwa Vidyapeetham\Documents\sem-5\ml\lab\Real estate.csv")

### Task 4. See the first 5 entries

In [14]:
df1.head(5)

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
0,1,2012.917,32.0,84.87882,10,24.98298,121.54024,37.9
1,2,2012.917,19.5,306.59470,9,24.98034,121.53951,42.2
2,3,2013.583,13.3,561.98450,5,24.98746,121.54391,47.3
3,4,2013.500,13.3,561.98450,5,24.98746,121.54391,54.8
4,5,2012.833,5.0,390.56840,5,24.97937,121.54245,43.1

### Task 5. What is the number of observations in the dataset?

In [15]:
len(df1)

414

### Task 6. What is the number of columns in the dataset?

In [16]:
col=len(df1.axes[1])
col

8

### Task 7. Print the name of all the columns.

In [17]:
df1.axes[1]

Index(['No', 'X1 transaction date', 'X2 house age',
       'X3 distance to the nearest MRT station',
       'X4 number of convenience stores', 'X5 latitude', 'X6 longitude',
       'Y house price of unit area'],
      dtype='object')

### Task 8. What is the name of 105th column?

In [20]:
z=df1.iloc[105]
z

No                                         106.00000
X1 transaction date                       2012.83300
X2 house age                                 0.00000
X3 distance to the nearest MRT station     292.99780
X4 number of convenience stores              6.00000
X5 latitude                                 24.97744
X6 longitude                               121.54458
Y house price of unit area                  71.00000
Name: 105, dtype: float64

### Task 9. What is the type of the observations of the 105th column?

In [21]:
z.dtype

dtype('float64')

### Task 10. How is the dataset indexed?

In [61]:
df1.index

RangeIndex(start=0, stop=414, step=1)

### Task 11. What is the product name of the 19th observation?

In [60]:
df1.iloc[19,1]

2012.667

### Task 12. How many columns in the dataset tend have null values?

In [59]:
x=len(df1)
c=0
for i in range(col):
    for j in range(x):
        if df1.isnull().iloc[i,j] is True:
            c=c+1
        break
print(c)

0

### Task 13. Find the number of null values present under each column?

In [58]:
df1.isnull().sum()

No                                        0
X1 transaction date                       0
X2 house age                              0
X3 distance to the nearest MRT station    0
X4 number of convenience stores           0
X5 latitude                               0
X6 longitude                              0
Y house price of unit area                0
dtype: int64

### Task 14. Create a dictionary with keys to be column names in the dataset and values to number of values under each column. Print the dictionary by iterating through its elements using a for loop.

In [72]:
dict={'rollno':[1,2,3],'name':['kani','dhanu','teja'],'sport':['ck','fb','bb']}
keys = dict.items()
print(keys)

24.98034

### Task 15. Display the values associated with all columns from row 108 to 208?

In [48]:
df1.iloc[108:208]

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
108,109,2013.417,31.4,592.5006,2,24.97260,121.53561,34.1
109,110,2013.583,4.0,2147.3760,3,24.96299,121.51284,28.4
110,111,2013.083,8.1,104.8101,5,24.96674,121.54067,51.6
111,112,2013.583,33.3,196.6172,7,24.97701,121.54224,39.4
112,113,2013.417,9.9,2102.4270,3,24.96044,121.51462,23.1
...,...,...,...,...,...,...,...,...
203,204,2012.667,15.6,289.3248,5,24.98203,121.54348,46.1
204,205,2013.000,18.0,1414.8370,1,24.95182,121.54887,26.6
205,206,2013.083,12.8,1449.7220,3,24.97289,121.51728,21.4
206,207,2013.250,22.2,379.5575,10,24.98343,121.53762,44.0
207,208,2013.083,38.5,665.0636,3,24.97503,121.53692,34.2